Tekla Open API Reference for Tekla Structures 2025
PrinterItem Constructor
 Creates a new printer item instance.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PrinterItem()
Public Sub New
See Also
Reference
PrinterItem Class
Tekla.Structures.Catalogs Namespace